extract_sentences = [
    {
        "input": {
            "vocabulary": "正式",
            "guide": "‎ＵＡＰの存在を正式に認め",
            "subtitle_japanese": "‎ねえ ウザいんだけど<br>‎アメリカ軍は<br>‎ＵＡＰの存在を正式に認め<br>‎“宇宙軍”を再編成しました",
            "subtitle_english": "Hey, you're being a pest.<br>The U.S. military has officially<br>acknowledged the existence of UAPs<br>and reformed the Space Force!"
        },
        "output": {
            "sentence_japanese": "アメリカ軍はＵＡＰの存在を正式に認め「宇宙軍」を再編成しました。",
            "sentence_english": "The U.S. military has officially acknowledged the existence of UAPs and reformed the Space Force!"
        }
    },
    {
        "input": {
            "vocabulary": "遭遇",
            "guide": "遭遇しただけでした！",
            "subtitle_japanese": "‎たぶん ジブンの見間違えっす<br>‎ただのエロい おばあちゃんに<br>‎遭遇しただけでした！<br>‎‎そこのヤツには<br>‎絶対 抜かれちゃダメだって",
            "subtitle_english": "I'm pretty sure I misunderstood something.<br>I simply bumped into a lewd granny!<br>They say you can't let her<br>outrun you at any cost!"
        },
        "output": {
            "sentence_japanese": "ただのエロいおばあちゃんに遭遇しただけでした！",
            "sentence_english": "I simply bumped into a lewd granny!"
        }
    },
    {
        "input": {
            "vocabulary": "証明",
            "guide": "‎さて 証明してやりましょうか",
            "subtitle_japanese": "‎心霊スポット<br>‎さて 証明してやりましょうか<br>‎<br>‎幽霊なんかいないってことを！",
            "subtitle_english": "At the spiritual hotspot.<br>Now, I'll go and prove it right now…<br>that there are no such things as ghosts!"
        },
        "output": {
            "sentence_japanese": "さて証明してやりましょうか幽霊なんかいないってことを！",
            "sentence_english": "Now, I'll go and prove it right now that there are no such things as ghosts!"
        }
    },
    {
        "input": {
            "vocabulary": "脳波",
            "guide": "‎まさか脳波を刺激しすぎたせいで",
            "subtitle_japanese": "なぜだ？<br>まさか脳波を刺激しすぎたせいで<br>女のヒトの“チャクラ”が<br>開いてしまったのか",
            "subtitle_english": "なぜだ？<br>まさか脳波を刺激しすぎたせいで<br>女のヒトの“チャクラ”が<br>開いてしまったのか"
        },
        "output": {
            "sentence_japanese": "まさか脳波を刺激しすぎたせいで女のヒトの“チャクラ”が開いてしまったのか。",
            "sentence_english": "Could it be that overstimulating brainwaves caused a woman's \"chakra\" to open?"
        }
    }
]

augment_furigana = [
    {
        "input": {
            "sentence": "アメリカ軍はＵＡＰの存在を正式に認め“宇宙軍”を再編成しました。"
        },
        "output": {
            "furigana": "<ruby>アメリカ<rt>あめりか</rt></ruby> <ruby>軍<rt>ぐん</rt></ruby> は ＵＡＰ の <ruby>存在<rt>そんざい</rt></ruby> を <ruby>正式<rt>せいしき</rt></ruby> に <ruby>認<rt>みと</rt></ruby>め “ <ruby>宇宙軍<rt>うちゅうぐん</rt></ruby> ” を <ruby>再編成<rt>さいへんせい</rt></ruby> しました 。"
        }
    },
    {
        "input": {
            "sentence": "まさか脳波を刺激しすぎたせいで女のヒトの「チャクラ」が開いてしまったのか。"
        },
        "output": {
            "furigana": "まさか <ruby>脳波<rt>のうは</rt></ruby> を <ruby>刺激<rt>しげき</rt></ruby> しすぎた せい で <ruby>女<rt>おんな</rt></ruby> の <ruby>ヒト<rt>ひと</rt></ruby> の 「 <ruby>チャクラ<rt>ちゃくら</rt></ruby> 」 が <ruby>開<rt>ひら</rt></ruby>いて しまった の か 。"
        }
    }
]

split_sentences = [
    {
        "input": [
            {
                "vocabulary": "正式",
                "sentence": "アメリカ軍はＵＡＰの存在を正式に認め“宇宙軍”を再編成しました。"
            },
            {
                "vocabulary": "正式",
                "sentence": "<ruby>アメリカ<rt>あめりか</rt></ruby> <ruby>軍<rt>ぐん</rt></ruby> は ＵＡＰ の <ruby>存在<rt>そんざい</rt></ruby> を <ruby>正式<rt>せいしき</rt></ruby> に <ruby>認<rt>みと</rt></ruby>め “ <ruby>宇宙軍<rt>うちゅうぐん</rt></ruby> ” を <ruby>再編成<rt>さいへんせい</rt></ruby> しました 。"
            },
            {
                "vocabulary": "正式",
                "sentence": "The U.S. military has officially acknowledged the existence of UAPs and reformed the Space Force!"
            }
        ],
        "output": {
            "split_sentences": [
                {
                    "prefix": "アメリカ軍はＵＡＰの存在を",
                    "middle": "正式",
                    "suffix": "に認め“宇宙軍”を再編成しました。"
                },
                {
                    "prefix": "<ruby>アメリカ<rt>あめりか</rt></ruby> <ruby>軍<rt>ぐん</rt></ruby> は ＵＡＰ の <ruby>存在<rt>そんざい</rt></ruby> を ",
                    "middle": "<ruby>正式<rt>せいしき</rt></ruby>",
                    "suffix": " に <ruby>認<rt>みと</rt></ruby>め “ <ruby>宇宙軍<rt>うちゅうぐん</rt></ruby> ” を <ruby>再編成<rt>さいへんせい</rt></ruby> しました 。"
                },
                {
                    "prefix": "The U.S. military has ",
                    "middle": "officially",
                    "suffix": " acknowledged the existence of UAPs and reformed the Space Force!"
                }
            ]
        }
    },
    {
        "input": [
            {
                "vocabulary": "近寄る",
                "sentence": "悪いもんが近寄って来れん。"
            },
            {
                "vocabulary": "近寄る",
                "sentence": "<ruby>悪<rt>わる</rt></ruby>い もん が <ruby>近寄<rt>ちかよ</rt></ruby>って <ruby>来<rt>こ</rt></ruby>れん 。"
            },
            {
                "vocabulary": "近寄る",
                "sentence": "Bad things can't get near you."
            }
        ],
        "output": {
            "split_sentences": [
                {
                    "prefix": "悪いもんが",
                    "middle": "近寄って",
                    "suffix": "来れん。"
                },
                {
                    "prefix": "<ruby>悪<rt>わる</rt></ruby>い もん が ",
                    "middle": "<ruby>近寄<rt>ちかよ</rt></ruby>って",
                    "suffix": " <ruby>来<rt>こ</rt></ruby>れん 。"
                },
                {
                    "prefix": "Bad things can't ",
                    "middle": "get near",
                    "suffix": " you."
                }
            ]
        }
    },
    {
        "input": [
            {
                "vocabulary": "証明",
                "sentence": "さて証明してやりましょうか幽霊なんかいないってことを！"
            },
            {
                "vocabulary": "証明",
                "sentence": "さて <ruby>証明<rt>しょうめい</rt></ruby> して やりましょう か <ruby>幽霊<rt>ゆうれい</rt></ruby> なんか いない って こと を ！"
            },
            {
                "vocabulary": "証明",
                "sentence": "Now, I'll go and prove it right now that there are no such things as ghosts!"
            }
        ],
        "output": {
            "split_sentences": [
                {
                    "prefix": "さて",
                    "middle": "証明",
                    "suffix": "してやりましょうか幽霊なんかいないってことを！"
                },
                {
                    "prefix": "さて ",
                    "middle": "<ruby>証明<rt>しょうめい</rt></ruby>",
                    "suffix": " して やりましょう か <ruby>幽霊<rt>ゆうれい</rt></ruby> なんか いない って こと を ！"
                },
                {
                    "prefix": "Now, I'll go and ",
                    "middle": "prove",
                    "suffix": " it right now that there are no such things as ghosts!"
                }
            ]
        }
    }
]


find_japanese_sentence = [
    {
        "input": {
            "japanese_sentence": "あんたは超能力で呪いを抑えておかないと暴走するし。",
            "transcription": [
                {
                    "start": 1.3600000143051147,
                    "end": 1.7599999904632568,
                    "text": "どう"
                },
                {
                    "start": 1.7599999904632568,
                    "end": 2.1600000858306885,
                    "text": "し"
                },
                {
                    "start": 2.1600000858306885,
                    "end": 2.5799999237060547,
                    "text": "ましょう"
                },
                {
                    "start": 2.5799999237060547,
                    "end": 3.5,
                    "text": "か"
                },
                {
                    "start": 3.5,
                    "end": 3.5999999046325684,
                    "text": "あ"
                },
                {
                    "start": 3.5999999046325684,
                    "end": 3.700000047683716,
                    "text": "ん"
                },
                {
                    "start": 3.700000047683716,
                    "end": 3.8399999141693115,
                    "text": "た"
                },
                {
                    "start": 3.8399999141693115,
                    "end": 4.0,
                    "text": "は"
                },
                {
                    "start": 4.0,
                    "end": 4.260000228881836,
                    "text": "超"
                },
                {
                    "start": 4.260000228881836,
                    "end": 4.420000076293945,
                    "text": "能"
                },
                {
                    "start": 4.420000076293945,
                    "end": 4.559999942779541,
                    "text": "力"
                },
                {
                    "start": 4.559999942779541,
                    "end": 4.820000171661377,
                    "text": "で"
                },
                {
                    "start": 4.820000171661377,
                    "end": 4.940000057220459,
                    "text": "呪"
                },
                {
                    "start": 4.940000057220459,
                    "end": 5.119999885559082,
                    "text": "い"
                },
                {
                    "start": 5.119999885559082,
                    "end": 5.260000228881836,
                    "text": "を"
                },
                {
                    "start": 5.260000228881836,
                    "end": 5.440000057220459,
                    "text": "抑"
                },
                {
                    "start": 5.440000057220459,
                    "end": 5.619999885559082,
                    "text": "えて"
                },
                {
                    "start": 5.619999885559082,
                    "end": 5.78000020980835,
                    "text": "お"
                },
                {
                    "start": 5.78000020980835,
                    "end": 5.920000076293945,
                    "text": "か"
                },
                {
                    "start": 5.920000076293945,
                    "end": 6.039999961853027,
                    "text": "ない"
                },
                {
                    "start": 6.039999961853027,
                    "end": 6.380000114440918,
                    "text": "と"
                },
                {
                    "start": 6.380000114440918,
                    "end": 6.460000038146973,
                    "text": "暴"
                },
                {
                    "start": 6.460000038146973,
                    "end": 6.539999961853027,
                    "text": "走"
                },
                {
                    "start": 6.539999961853027,
                    "end": 6.920000076293945,
                    "text": "する"
                },
                {
                    "start": 6.920000076293945,
                    "end": 7.380000114440918,
                    "text": "し"
                },
                {
                    "start": 7.380000114440918,
                    "end": 7.639999866485596,
                    "text": "す"
                },
                {
                    "start": 7.639999866485596,
                    "end": 7.659999847412109,
                    "text": "い"
                },
                {
                    "start": 7.659999847412109,
                    "end": 8.180000305175781,
                    "text": "ません"
                },
                {
                    "start": 8.180000305175781,
                    "end": 8.520000457763672,
                    "text": "う"
                },
                {
                    "start": 8.520000457763672,
                    "end": 8.720000267028809,
                    "text": "ちは"
                },
                {
                    "start": 8.720000267028809,
                    "end": 9.100000381469727,
                    "text": "制"
                },
                {
                    "start": 9.100000381469727,
                    "end": 9.220000267028809,
                    "text": "服"
                },
                {
                    "start": 9.220000267028809,
                    "end": 9.520000457763672,
                    "text": "も"
                },
                {
                    "start": 9.520000457763672,
                    "end": 9.739999771118164,
                    "text": "財"
                },
                {
                    "start": 9.739999771118164,
                    "end": 9.739999771118164,
                    "text": "布"
                },
                {
                    "start": 9.739999771118164,
                    "end": 10.100000381469727,
                    "text": "も"
                },
                {
                    "start": 10.100000381469727,
                    "end": 10.300000190734863,
                    "text": "ス"
                },
                {
                    "start": 10.300000190734863,
                    "end": 10.300000190734863,
                    "text": "マ"
                },
                {
                    "start": 10.300000190734863,
                    "end": 10.399999618530273,
                    "text": "ホ"
                },
                {
                    "start": 10.399999618530273,
                    "end": 10.680000305175781,
                    "text": "も"
                },
                {
                    "start": 10.680000305175781,
                    "end": 11.020000457763672,
                    "text": "全部"
                }
            ]
        },
        "output": {
            "begin": 3.5,
            "end": 7.380000114440918
        }
    },
    {
        "input": {
            "japanese_sentence": "悪いもんが近寄って来れん。",
            "transcription": [
                {
                    "start": 0.0,
                    "end": 0.18000000715255737,
                    "text": "気"
                },
                {
                    "start": 0.18000000715255737,
                    "end": 0.4399999976158142,
                    "text": "を"
                },
                {
                    "start": 0.4399999976158142,
                    "end": 0.5400000214576721,
                    "text": "出"
                },
                {
                    "start": 0.5400000214576721,
                    "end": 0.8199999928474426,
                    "text": "して"
                },
                {
                    "start": 0.8199999928474426,
                    "end": 0.9200000166893005,
                    "text": "い"
                },
                {
                    "start": 0.9200000166893005,
                    "end": 0.9200000166893005,
                    "text": "れ"
                },
                {
                    "start": 0.9200000166893005,
                    "end": 1.3200000524520874,
                    "text": "ば、"
                },
                {
                    "start": 1.5,
                    "end": 1.5399999618530273,
                    "text": "事"
                },
                {
                    "start": 1.5399999618530273,
                    "end": 1.6200000047683716,
                    "text": "故"
                },
                {
                    "start": 1.6200000047683716,
                    "end": 1.7599999904632568,
                    "text": "に"
                },
                {
                    "start": 1.7599999904632568,
                    "end": 2.0,
                    "text": "も"
                },
                {
                    "start": 2.0,
                    "end": 2.140000104904175,
                    "text": "病"
                },
                {
                    "start": 2.140000104904175,
                    "end": 2.240000009536743,
                    "text": "気"
                },
                {
                    "start": 2.240000009536743,
                    "end": 2.4200000762939453,
                    "text": "に"
                },
                {
                    "start": 2.4200000762939453,
                    "end": 2.680000066757202,
                    "text": "も"
                },
                {
                    "start": 2.680000066757202,
                    "end": 2.7799999713897705,
                    "text": "なら"
                },
                {
                    "start": 2.7799999713897705,
                    "end": 3.140000104904175,
                    "text": "ん。"
                },
                {
                    "start": 3.299999952316284,
                    "end": 3.4200000762939453,
                    "text": "悪"
                },
                {
                    "start": 3.4200000762939453,
                    "end": 3.619999885559082,
                    "text": "い"
                },
                {
                    "start": 3.619999885559082,
                    "end": 3.6600000858306885,
                    "text": "も"
                },
                {
                    "start": 3.6600000858306885,
                    "end": 3.700000047683716,
                    "text": "ん"
                },
                {
                    "start": 3.700000047683716,
                    "end": 3.880000114440918,
                    "text": "が"
                },
                {
                    "start": 3.880000114440918,
                    "end": 4.099999904632568,
                    "text": "近"
                },
                {
                    "start": 4.099999904632568,
                    "end": 4.139999866485596,
                    "text": "寄"
                },
                {
                    "start": 4.139999866485596,
                    "end": 4.400000095367432,
                    "text": "って"
                },
                {
                    "start": 4.400000095367432,
                    "end": 4.559999942779541,
                    "text": "来"
                },
                {
                    "start": 4.559999942779541,
                    "end": 4.619999885559082,
                    "text": "れ"
                },
                {
                    "start": 4.619999885559082,
                    "end": 5.0,
                    "text": "ん。"
                },
                {
                    "start": 6.079999923706055,
                    "end": 6.340000152587891,
                    "text": "まず"
                },
                {
                    "start": 6.340000152587891,
                    "end": 6.599999904632568,
                    "text": "お"
                },
                {
                    "start": 6.599999904632568,
                    "end": 6.760000228881836,
                    "text": "腹"
                },
                {
                    "start": 6.760000228881836,
                    "end": 7.059999942779541,
                    "text": "の"
                },
                {
                    "start": 7.059999942779541,
                    "end": 7.119999885559082,
                    "text": "下"
                },
                {
                    "start": 7.119999885559082,
                    "end": 7.440000057220459,
                    "text": "に"
                },
                {
                    "start": 7.440000057220459,
                    "end": 7.760000228881836,
                    "text": "力"
                },
                {
                    "start": 7.760000228881836,
                    "end": 8.0600004196167,
                    "text": "を"
                },
                {
                    "start": 8.0600004196167,
                    "end": 8.100000381469727,
                    "text": "入"
                },
                {
                    "start": 8.100000381469727,
                    "end": 8.359999656677246,
                    "text": "れて。"
                }
            ]
        },
        "output": {
            "begin": 3.299999952316284,
            "end": 5.0
        }
    },
    {
        "input": {
            "japanese_sentence": "まさか脳波を刺激しすぎたせいで女のヒトの“チャクラ”が開いてしまったのか。",
            "transcription": [
                {
                    "start": 0.0,
                    "end": 0.3400000035762787,
                    "text": "な"
                },
                {
                    "start": 0.3400000035762787,
                    "end": 2.359999895095825,
                    "text": "ぜ"
                },
                {
                    "start": 2.359999895095825,
                    "end": 3.2799999713897705,
                    "text": "か、"
                },
                {
                    "start": 3.2799999713897705,
                    "end": 3.359999895095825,
                    "text": "ま"
                },
                {
                    "start": 3.359999895095825,
                    "end": 3.5199999809265137,
                    "text": "さ"
                },
                {
                    "start": 3.5199999809265137,
                    "end": 3.700000047683716,
                    "text": "か"
                },
                {
                    "start": 3.700000047683716,
                    "end": 3.880000114440918,
                    "text": "ノ"
                },
                {
                    "start": 3.880000114440918,
                    "end": 3.9000000953674316,
                    "text": "ウ"
                },
                {
                    "start": 3.9000000953674316,
                    "end": 4.019999980926514,
                    "text": "ハ"
                },
                {
                    "start": 4.019999980926514,
                    "end": 4.179999828338623,
                    "text": "ウ"
                },
                {
                    "start": 4.179999828338623,
                    "end": 4.199999809265137,
                    "text": "を"
                },
                {
                    "start": 4.199999809265137,
                    "end": 4.300000190734863,
                    "text": "刺"
                },
                {
                    "start": 4.300000190734863,
                    "end": 4.460000038146973,
                    "text": "激"
                },
                {
                    "start": 4.460000038146973,
                    "end": 4.760000228881836,
                    "text": "し"
                },
                {
                    "start": 4.760000228881836,
                    "end": 4.860000133514404,
                    "text": "す"
                },
                {
                    "start": 4.860000133514404,
                    "end": 4.900000095367432,
                    "text": "ぎ"
                },
                {
                    "start": 4.900000095367432,
                    "end": 5.119999885559082,
                    "text": "た"
                },
                {
                    "start": 5.119999885559082,
                    "end": 5.239999771118164,
                    "text": "せ"
                },
                {
                    "start": 5.239999771118164,
                    "end": 5.360000133514404,
                    "text": "い"
                },
                {
                    "start": 5.360000133514404,
                    "end": 5.599999904632568,
                    "text": "で"
                },
                {
                    "start": 5.599999904632568,
                    "end": 5.800000190734863,
                    "text": "女"
                },
                {
                    "start": 5.800000190734863,
                    "end": 6.059999942779541,
                    "text": "の"
                },
                {
                    "start": 6.059999942779541,
                    "end": 6.179999828338623,
                    "text": "人"
                },
                {
                    "start": 6.179999828338623,
                    "end": 6.539999961853027,
                    "text": "の"
                },
                {
                    "start": 6.539999961853027,
                    "end": 6.639999866485596,
                    "text": "チャ"
                },
                {
                    "start": 6.639999866485596,
                    "end": 6.679999828338623,
                    "text": "ク"
                },
                {
                    "start": 6.679999828338623,
                    "end": 6.840000152587891,
                    "text": "ラ"
                },
                {
                    "start": 6.840000152587891,
                    "end": 7.059999942779541,
                    "text": "が"
                },
                {
                    "start": 7.059999942779541,
                    "end": 7.260000228881836,
                    "text": "開"
                },
                {
                    "start": 7.260000228881836,
                    "end": 7.559999942779541,
                    "text": "いて"
                },
                {
                    "start": 7.559999942779541,
                    "end": 7.800000190734863,
                    "text": "しま"
                },
                {
                    "start": 7.800000190734863,
                    "end": 8.039999961853027,
                    "text": "った"
                },
                {
                    "start": 8.039999961853027,
                    "end": 8.260000228881836,
                    "text": "の"
                },
                {
                    "start": 8.260000228881836,
                    "end": 8.520000457763672,
                    "text": "か"
                }
            ]
        },
        "output": {
            "begin": 3.2799999713897705,
            "end": 8.520000457763672
        }
    },
    {
        "input": {
            "japanese_sentence": "ただのエロいおばあちゃんに遭遇しただけでした！",
            "transcription": [
                {
                    "start": 1.3600000143051147,
                    "end": 1.6799999475479126,
                    "text": "多"
                },
                {
                    "start": 1.6799999475479126,
                    "end": 1.840000033378601,
                    "text": "分"
                },
                {
                    "start": 1.840000033378601,
                    "end": 2.0199999809265137,
                    "text": "自"
                },
                {
                    "start": 2.0199999809265137,
                    "end": 2.0999999046325684,
                    "text": "分"
                },
                {
                    "start": 2.0999999046325684,
                    "end": 2.359999895095825,
                    "text": "の"
                },
                {
                    "start": 2.359999895095825,
                    "end": 2.4800000190734863,
                    "text": "見"
                },
                {
                    "start": 2.4800000190734863,
                    "end": 2.559999942779541,
                    "text": "間"
                },
                {
                    "start": 2.559999942779541,
                    "end": 2.7200000286102295,
                    "text": "違"
                },
                {
                    "start": 2.7200000286102295,
                    "end": 2.880000114440918,
                    "text": "い"
                },
                {
                    "start": 2.880000114440918,
                    "end": 3.0399999618530273,
                    "text": "数"
                },
                {
                    "start": 3.1600000858306885,
                    "end": 3.4800000190734863,
                    "text": "ただ"
                },
                {
                    "start": 3.4800000190734863,
                    "end": 3.700000047683716,
                    "text": "の"
                },
                {
                    "start": 3.700000047683716,
                    "end": 3.8399999141693115,
                    "text": "エ"
                },
                {
                    "start": 3.8399999141693115,
                    "end": 3.8399999141693115,
                    "text": "ロ"
                },
                {
                    "start": 3.8399999141693115,
                    "end": 4.0,
                    "text": "い"
                },
                {
                    "start": 4.0,
                    "end": 4.099999904632568,
                    "text": "お"
                },
                {
                    "start": 4.099999904632568,
                    "end": 4.159999847412109,
                    "text": "ば"
                },
                {
                    "start": 4.159999847412109,
                    "end": 4.300000190734863,
                    "text": "あ"
                },
                {
                    "start": 4.300000190734863,
                    "end": 4.420000076293945,
                    "text": "ちゃん"
                },
                {
                    "start": 4.420000076293945,
                    "end": 4.760000228881836,
                    "text": "に"
                },
                {
                    "start": 4.840000152587891,
                    "end": 4.840000152587891,
                    "text": "遭"
                },
                {
                    "start": 4.840000152587891,
                    "end": 4.960000038146973,
                    "text": "遇"
                },
                {
                    "start": 4.960000038146973,
                    "end": 5.28000020980835,
                    "text": "した"
                },
                {
                    "start": 5.28000020980835,
                    "end": 5.519999980926514,
                    "text": "だけ"
                },
                {
                    "start": 5.519999980926514,
                    "end": 6.21999979019165,
                    "text": "でした"
                },
                {
                    "start": 7.260000228881836,
                    "end": 7.579999923706055,
                    "text": "そ"
                },
                {
                    "start": 7.579999923706055,
                    "end": 7.679999828338623,
                    "text": "こ"
                },
                {
                    "start": 7.679999828338623,
                    "end": 7.900000095367432,
                    "text": "で"
                },
                {
                    "start": 7.900000095367432,
                    "end": 8.0,
                    "text": "エ"
                },
                {
                    "start": 8.0,
                    "end": 8.0,
                    "text": "ス"
                },
                {
                    "start": 8.0,
                    "end": 8.020000457763672,
                    "text": "ニ"
                },
                {
                    "start": 8.020000457763672,
                    "end": 8.020000457763672,
                    "text": "ー"
                },
                {
                    "start": 8.020000457763672,
                    "end": 8.279999732971191,
                    "text": "は"
                },
                {
                    "start": 8.279999732971191,
                    "end": 8.520000457763672,
                    "text": "絶"
                },
                {
                    "start": 8.520000457763672,
                    "end": 8.720000267028809,
                    "text": "対"
                },
                {
                    "start": 8.880000114440918,
                    "end": 8.899999618530273,
                    "text": "抜"
                },
                {
                    "start": 8.899999618530273,
                    "end": 9.020000457763672,
                    "text": "か"
                },
                {
                    "start": 9.020000457763672,
                    "end": 9.100000381469727,
                    "text": "れ"
                },
                {
                    "start": 9.100000381469727,
                    "end": 9.239999771118164,
                    "text": "ちゃ"
                },
                {
                    "start": 9.239999771118164,
                    "end": 9.399999618530273,
                    "text": "ダ"
                },
                {
                    "start": 9.399999618530273,
                    "end": 9.5,
                    "text": "メ"
                },
                {
                    "start": 9.5,
                    "end": 9.680000305175781,
                    "text": "だ"
                },
                {
                    "start": 9.680000305175781,
                    "end": 9.920000076293945,
                    "text": "って"
                }
            ]
        },
        "output": {
            "begin": 3.1600000858306885,
            "end": 6.21999979019165
        }

    },
    {
        "input": {
            "japanese_sentence": "さて証明してやりましょうか幽霊なんかいないってことを！",
            "transcription": [
                {
                    "start": 3.299999952316284,
                    "end": 3.7799999713897705,
                    "text": "【"
                },
                {
                    "start": 3.7799999713897705,
                    "end": 3.7799999713897705,
                    "text": "ド"
                },
                {
                    "start": 3.7799999713897705,
                    "end": 3.7799999713897705,
                    "text": "ラ"
                },
                {
                    "start": 3.7799999713897705,
                    "end": 3.7799999713897705,
                    "text": "マ"
                },
                {
                    "start": 3.7799999713897705,
                    "end": 3.7799999713897705,
                    "text": "】"
                },
                {
                    "start": 3.7799999713897705,
                    "end": 3.7799999713897705,
                    "text": "さ"
                },
                {
                    "start": 3.7799999713897705,
                    "end": 4.019999980926514,
                    "text": "て、"
                },
                {
                    "start": 4.599999904632568,
                    "end": 4.599999904632568,
                    "text": "証"
                },
                {
                    "start": 4.599999904632568,
                    "end": 4.699999809265137,
                    "text": "明"
                },
                {
                    "start": 4.699999809265137,
                    "end": 4.920000076293945,
                    "text": "して"
                },
                {
                    "start": 4.920000076293945,
                    "end": 5.079999923706055,
                    "text": "や"
                },
                {
                    "start": 5.079999923706055,
                    "end": 5.119999885559082,
                    "text": "り"
                },
                {
                    "start": 5.119999885559082,
                    "end": 5.380000114440918,
                    "text": "ましょう"
                },
                {
                    "start": 5.380000114440918,
                    "end": 5.960000038146973,
                    "text": "か"
                },
                {
                    "start": 6.579999923706055,
                    "end": 6.619999885559082,
                    "text": "幽"
                },
                {
                    "start": 6.619999885559082,
                    "end": 6.699999809265137,
                    "text": "霊"
                },
                {
                    "start": 6.699999809265137,
                    "end": 7.139999866485596,
                    "text": "なんか"
                },
                {
                    "start": 7.139999866485596,
                    "end": 7.440000057220459,
                    "text": "い"
                },
                {
                    "start": 7.440000057220459,
                    "end": 7.599999904632568,
                    "text": "ない"
                },
                {
                    "start": 7.599999904632568,
                    "end": 7.840000152587891,
                    "text": "って"
                },
                {
                    "start": 7.840000152587891,
                    "end": 8.100000381469727,
                    "text": "こと"
                },
                {
                    "start": 8.100000381469727,
                    "end": 8.420000076293945,
                    "text": "ぉ"
                },
                {
                    "start": 8.640000343322754,
                    "end": 9.119999885559082,
                    "text": "は"
                },
                {
                    "start": 9.119999885559082,
                    "end": 9.180000305175781,
                    "text": "ーい、"
                },
                {
                    "start": 9.239999771118164,
                    "end": 9.520000457763672,
                    "text": "真"
                },
                {
                    "start": 9.520000457763672,
                    "end": 9.520000457763672,
                    "text": "ん"
                },
                {
                    "start": 9.520000457763672,
                    "end": 9.640000343322754,
                    "text": "中"
                },
                {
                    "start": 9.640000343322754,
                    "end": 9.84000015258789,
                    "text": "ビ"
                },
                {
                    "start": 9.84000015258789,
                    "end": 9.84000015258789,
                    "text": "ビ"
                },
                {
                    "start": 9.84000015258789,
                    "end": 9.84000015258789,
                    "text": "って"
                }
            ]
        },
        "output": {
            "begin": 3.7799999713897705,
            "end": 8.420000076293945
        }
    },
    {
        "input": {
            "japanese_sentence": "退行催眠って知ってます？",
            "transcription": [
                {
                    "start": 0.4000000059604645,
                    "end": 0.7200000286102295,
                    "text": "おい、"
                },
                {
                    "start": 1.0199999809265137,
                    "end": 1.0199999809265137,
                    "text": "お"
                },
                {
                    "start": 1.0199999809265137,
                    "end": 1.1399999856948853,
                    "text": "前"
                },
                {
                    "start": 1.1399999856948853,
                    "end": 1.3799999952316284,
                    "text": "U"
                },
                {
                    "start": 1.3799999952316284,
                    "end": 1.5,
                    "text": "FO"
                },
                {
                    "start": 1.5,
                    "end": 1.7000000476837158,
                    "text": "見"
                },
                {
                    "start": 1.7000000476837158,
                    "end": 1.8200000524520874,
                    "text": "た"
                },
                {
                    "start": 1.8200000524520874,
                    "end": 1.9800000190734863,
                    "text": "こと"
                },
                {
                    "start": 1.9800000190734863,
                    "end": 2.200000047683716,
                    "text": "ね"
                },
                {
                    "start": 2.200000047683716,
                    "end": 2.259999990463257,
                    "text": "え"
                },
                {
                    "start": 2.259999990463257,
                    "end": 2.380000114440918,
                    "text": "だ"
                },
                {
                    "start": 2.380000114440918,
                    "end": 3.0399999618530273,
                    "text": "ろ"
                },
                {
                    "start": 3.2799999713897705,
                    "end": 3.5999999046325684,
                    "text": "対"
                },
                {
                    "start": 3.5999999046325684,
                    "end": 3.759999990463257,
                    "text": "抗"
                },
                {
                    "start": 3.759999990463257,
                    "end": 4.0,
                    "text": "催"
                },
                {
                    "start": 4.0,
                    "end": 4.059999942779541,
                    "text": "眠"
                },
                {
                    "start": 4.059999942779541,
                    "end": 4.28000020980835,
                    "text": "って"
                },
                {
                    "start": 4.28000020980835,
                    "end": 4.400000095367432,
                    "text": "知"
                },
                {
                    "start": 4.400000095367432,
                    "end": 4.5,
                    "text": "って"
                },
                {
                    "start": 4.5,
                    "end": 4.760000228881836,
                    "text": "ます"
                },
                {
                    "start": 5.079999923706055,
                    "end": 5.079999923706055,
                    "text": "は"
                },
                {
                    "start": 5.079999923706055,
                    "end": 5.159999847412109,
                    "text": "ぐ"
                },
                {
                    "start": 5.159999847412109,
                    "end": 5.300000190734863,
                    "text": "ら"
                },
                {
                    "start": 5.300000190734863,
                    "end": 5.440000057220459,
                    "text": "か"
                },
                {
                    "start": 5.440000057220459,
                    "end": 5.599999904632568,
                    "text": "して"
                },
                {
                    "start": 5.599999904632568,
                    "end": 5.78000020980835,
                    "text": "ん"
                },
                {
                    "start": 5.78000020980835,
                    "end": 5.900000095367432,
                    "text": "じゃ"
                },
                {
                    "start": 5.900000095367432,
                    "end": 6.039999961853027,
                    "text": "ね"
                },
                {
                    "start": 6.039999961853027,
                    "end": 6.179999828338623,
                    "text": "え"
                },
                {
                    "start": 6.179999828338623,
                    "end": 6.480000019073486,
                    "text": "ぞ"
                },
                {
                    "start": 6.480000019073486,
                    "end": 6.800000190734863,
                    "text": "見"
                },
                {
                    "start": 6.800000190734863,
                    "end": 6.940000057220459,
                    "text": "た"
                },
                {
                    "start": 6.940000057220459,
                    "end": 7.059999942779541,
                    "text": "か"
                },
                {
                    "start": 7.059999942779541,
                    "end": 7.21999979019165,
                    "text": "どう"
                },
                {
                    "start": 7.21999979019165,
                    "end": 7.440000057220459,
                    "text": "か"
                },
                {
                    "start": 7.440000057220459,
                    "end": 7.71999979019165,
                    "text": "問題"
                },
                {
                    "start": 7.71999979019165,
                    "end": 8.0600004196167,
                    "text": "じゃない"
                },
                {
                    "start": 8.0600004196167,
                    "end": 8.319999694824219,
                    "text": "んです"
                },
                {
                    "start": 8.319999694824219,
                    "end": 8.520000457763672,
                    "text": "よ"
                }
            ]
        },
        "output": {
            "begin": 3.759999990463257,
            "end": 4.760000228881836
        }
    }
]
